app/controllers/module_controller.rb

  def index
      if params[:filename].nil?: redirect_to :filename => :intro end
      @page = Page.find :first, :conditions => {:filename => params[:filename]}
---
SELECT * FROM `pages` WHERE (number IS NOT NULL) ORDER BY number ASC